Revit 2026 API

# HandRailTypeHeight Property

---

The height of the handrail.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Height { get; set; }
```
```vb
Public Property Height As Double
	Get
	Set
```
```cpp
public:
property double Height {
	double get ();
	void set (double value);
}
```
```fsharp
member Height : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for height must be between 0 and 30000 feet. |

#### Reference

HandRailType Class

Autodesk.Revit.DB.Architecture Namespace